iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Firmware/iRidiumDevice/CDevice.cpp
//////////////////////////////////////////////////////////////////////////
// class CDevice
//////////////////////////////////////////////////////////////////////////
// Включения
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"
#include "Main.h"
#include "stdlib.h"

// iRidium device
#include "CDevice.h"

// iRidium protocol
#include "IridiumCRC16.h"
#include "CIridiumStreebog.h"

// Common
#include "CCanPort.h"
#include "EEPROM.h"
#include "MemoryMap.h"
#include "InputOutput.h"
#include "UTF8.h"

#define MAX_DEVICE_CHANNELS            4           // Максимальное количество каналов управления
#define MAX_DEVICE_TAGS                2           // Максимальное количество каналов обратной связи

#define MAX_VARIABLES                  16          // Максимальное количество глобальных переменных на канал управления

#define FIRMWARE_READ_STREAM_ID        1           // Идентификатор потока чтения прошивки
#define FIRMWARE_WRITE_STREAM_ID       2           // Идентификатор потока записи прошивки

#define MAX_SAVE_CHANNELS              1           // Максимальное количество сохраняемых каналов
#define START_SAVE_CHANNEL_INDEX       3           // Начальный индекс сохраняемого канала управления
#define END_SAVE_CHANNEL_INDEX         4           // Конечный индекс сохраняемого канаоа управления

#define MAX_SAVE_TAGS                  MAX_DEVICE_TAGS   // Максимальное количество дискретных каналов

#define MAX_INPUTS                     0           // Максимальное количество дискретных каналов

///////////////////////////////////////////////////////////////////////////////
// Карта индексов переменных в энергонезависимой памяти
///////////////////////////////////////////////////////////////////////////////
// Данные устройства
#define EEPROM_U8_OWNER_VARIABLE       (EEPROM_START_DEVICE_DATA)
#define EEPROM_U16_CHANNEL_VARIABLES   (EEPROM_U8_OWNER_VARIABLE + ((MAX_SAVE_TAGS + 7) / 8))
#define EEPROM_U16_TAG_VARIABLES       (EEPROM_U16_CHANNEL_VARIABLES + MAX_SAVE_CHANNELS * MAX_VARIABLES * 2)
#define EEPROM_U8_INPUT_FLAGS          (EEPROM_U16_TAG_VARIABLES + MAX_SAVE_TAGS * 2)
#define EEPROM_U16_INPUT_TIME          (EEPROM_U8_INPUT_FLAGS + MAX_INPUTS)
#define EEPROM_TAIL                    (EEPROM_U16_INPUT_TIME + MAX_INPUTS * 2)

///////////////////////////////////////////////////////////////////////////////
// Информация об устройстве
///////////////////////////////////////////////////////////////////////////////
const char g_pszProducer[]    = "iRidium";
const char g_pszModelName[]   = "iRidium firmware";

char g_szDeviceName[MAX_DEVICE_NAME_SIZE + 1];     // Имя устройства
char g_pszHWID[STREEBOG_HASH_256_BYTES + 1];       // Аппаратный идентификатор шеснадцатеричное представление 128 битного числа + 1 байт

u8 g_aEEPROM[EEPROM_MAX];                          // Данные энергонезависимой памяти

char g_szTemp[128];                                // Промежуточный буфер

// Информация об устройстве
const iridium_device_info_t g_DeviceInfo =
{
   IRIDIUM_GROUP_TYPE_ACTUATOR,
   g_szDeviceName,
   (char*)g_pszProducer,
   (char*)g_pszModelName,
   (char*)g_pszHWID,
   OST_NONE << 16 | PT_ARM << 8 | DCT_MICROCONTROLLER,
   0x00010001,
   0,
   0
};

///////////////////////////////////////////////////////////////////////////////
// Информация о каналах управления
///////////////////////////////////////////////////////////////////////////////
// Идентификаторы каналов управления
enum eChannels
{
   CHANNEL_NAME = 1,                               // Имя устройства
   CHANNEL_PIN,                                    // Пин код устройства
   CHANNEL_REBOOT,                                 // Перезагрузка устройства
   CHANNEL_TEST,                                   // Тестовый канал
};

// Имена каналов управления
const char g_pszChannelName[]    = "Имя устройства";
const char g_pszChannelPIN[]     = "PIN код";
const char g_pszChannelReboot[]  = "Перезагрузка устройства";
const char g_pszChannelTest[]    = "Тестовый канал";

// Текстовое описание каналов обратной связи
const char g_pszChannelDescriptionName[]  = "32 байта(16 сим. латин(кирил)ицей)";
const char g_pszChannelDescriptionPIN[]   = "Персональное идентификационное число";

// Массив с описанием канала управления
const device_channel_t g_aDeviceChannels[MAX_DEVICE_CHANNELS] =
{
   {  CHANNEL_NAME,     (char*)g_pszChannelName,   IVT_STRING8,   0,       32,         1,       (char*)g_pszChannelDescriptionName, CF_W,          0              },
   {  CHANNEL_PIN,      (char*)g_pszChannelPIN,    IVT_U32,       0,       0xFFFFFFFF, 1,       (char*)g_pszChannelDescriptionPIN,  CF_W | CF_R,   0              },
   {  CHANNEL_REBOOT,   (char*)g_pszChannelReboot, IVT_BOOL,      false,   true,       false,   (char*)g_pszChannelReboot,          CF_W,          0              },
   {  CHANNEL_TEST,     (char*)g_pszChannelTest,   IVT_U8,        0,       100,        1,       (char*)g_pszChannelTest,            CF_W,          MAX_VARIABLES  },
};

// Массив определяющий связь между каналом обратной связи и глобальной переменной
u16 g_aChannelsVariable[MAX_DEVICE_CHANNELS][MAX_VARIABLES];

///////////////////////////////////////////////////////////////////////////////
// Информация о каналах обратной связи
///////////////////////////////////////////////////////////////////////////////
// Идентификаторы каналов обратной связи
enum eTags
{
   TAG_ERROR = 1,                                  // Код ошибки
   TAG_TEST,                                       // Тестовый канал
};

// Имена каналов обратной связи
const char g_pszTagError[]    = "Код ошибки";
const char g_pszTagTest[]     = "Тестовые каналы";

// Текстовое описание каналов обратной связи
const char g_pszTagDescriptionError[]  = "Код ошибки";
const char g_pszTagDescriptionTest[]   = "Тестовые каналы";

// Массив с описанием канала управления
const device_tag_t g_aDeviceTags[MAX_DEVICE_TAGS] =
{
   {  TAG_ERROR,  (char*)g_pszTagError,   IVT_U8,     0,          255,              1,          (char*)g_pszTagDescriptionError, CF_W  },
   {  TAG_TEST,   (char*)g_pszTagTest,    IVT_U8,     0,          255,              1,          (char*)g_pszTagDescriptionTest,  CF_W  },
};

// Массив определяющий связь между каналом обратной связи и глобальными переменными
u16 g_aTagsVariable[MAX_SAVE_TAGS];

