iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Firmware/iRidiumDevice/CDevice.cpp
// Массив флагов определяющих владение глобальной переменной
u8 g_aTagOwners[(MAX_SAVE_TAGS + 7) / 8];

u8 g_u8Test = 0;

#pragma pack(push, 1)

// Описание канала управления/обратной связи
typedef struct smart_api_channel_s
{
   u32   m_u32ID;                                  // Идентификатор канала управления/обратной связи устройства
   u32   m_u32Type;                                // Смарт тип канала
} smart_api_channel_t;

// Описание смарт устройства
typedef struct smart_api_device_s
{
   u32                  m_u32SmartID;              // Идентификатор смарт устройства
   u32                  m_u32Tags;                 // Количество каналов обратной связи смарт устройства
   u32                  m_u32Channels;             // Количество каналов управления смарт устройства
} smart_api_device_t;

// Структура кнопки
typedef struct wb_smart_button_s
{
   smart_api_device_t   m_Header;   
   smart_api_channel_t  m_Data[4];
} wb_smart_button_t;

// Структура реле
typedef struct wb_smart_relay_s
{
   smart_api_device_t   m_Header;   
   smart_api_channel_t  m_Data[2];
} wb_smart_relay_t;

// Структура реле
typedef struct wb_smart_device_s
{
   u16                  m_u16Count;
   wb_smart_button_t    m_Button[7];
   wb_smart_relay_t     m_Relay[6];
} wb_smart_device_t;

#pragma pack(pop)

/*
// Смарт описание устройства
wb_smart_device_t    g_SmartAPI =
{
   13,
   {
      // Onboard Button
      {
         { 10, 2, 2 },
         {
            { 1, 17}, { 2, 92 },
            { CHANNEL_MODE_ONBOARD, 0  }, { CHANNEL_TIME_ONBOARD, 0  }
         }
      }, 
      // Button 1
      {
         { 10, 2, 2 },
         {
            { 3, 17}, { 4, 92 },
            { CHANNEL_MODE_1, 0  }, { CHANNEL_TIME_1, 0  }
         }
      }, 
      // Button 2
      {
         { 10, 2, 2 },
         {
            { 5, 17}, { 6, 92 },
            { CHANNEL_MODE_2, 0  }, { CHANNEL_TIME_2, 0  }
         }
      }, 
      // Button 3
      {
         { 10, 2, 2 },
         {
            { 7, 17}, { 8, 92 },
            { CHANNEL_MODE_3, 0  }, { CHANNEL_TIME_3, 0  }
         }
      }, 
      // Button 4
      {
         { 10, 2, 2 },
         {
            { 9, 17}, { 10, 92 },
            { CHANNEL_MODE_4, 0  }, { CHANNEL_TIME_4, 0  }
         }
      }, 
      // Button 5
      {
         { 10, 2, 2 },
         {
            { 11, 17}, { 12, 92 },
            { CHANNEL_MODE_5, 0  }, { CHANNEL_TIME_5, 0  }
         }
      }, 
      // Button 6
      {
         { 10, 2, 2 },
         {
            { 13, 17}, { 14, 92 },
            { CHANNEL_MODE_6, 0  }, { CHANNEL_TIME_6, 0  }
         }
      }
   },
   {
      // Relay 1
      {
         { 2, 1, 1 },
         {
            { 15, 1 },
            { CHANNEL_RELAY_1, 1  }
         }
      }, 
      // Relay 2
      {
         { 2, 1, 1 },
         {
            { 16, 1 },
            { CHANNEL_RELAY_2, 1  }
         }
      }, 
      // Relay 3
      {
         { 2, 1, 1 },
         {
            { 17, 1 },
            { CHANNEL_RELAY_3, 1  }
         }
      }, 
      // Relay 4
      {
         { 2, 1, 1 },
         {
            { 18, 1 },
            { CHANNEL_RELAY_4, 1  }
         }
      }, 
      // Relay 5
      {
         { 2, 1, 1 },
         {
            { 19, 1 },
            { CHANNEL_RELAY_5, 1  }
         }
      }, 
   }
};
*/

// Для работы с временем
volatile uint32_t g_u32TickPerUs    = HAL_RCC_GetHCLKFreq() / 1000000;  // Количество тиков в 1 микросекунде

CDevice                 g_Device;                  // Данные объекта
CIridiumBusInBuffer     g_InBuffer;                // Входящий буфер для приема и обработки собщений
CIridiumBusInBuffer     g_MessageBuffer;           // Входящий буфер для приема и обработки собщений
CIridiumBusOutBuffer    g_OutBuffer;               // Исходящий буфер 
u8                      g_aOutBuffer[IRIDIUM_BUS_OUT_BUFFER_SIZE];

// Указатель на данные HAL CAN порта
extern CAN_HandleTypeDef   hcan;

static CanTxMsgTypeDef  g_aCanTxMessage;           // Структура для отправляемого сообщения
static CanRxMsgTypeDef  g_aCanRxMessage;           // Структура для принимаемого сообщения

// Параметры CAN порта для сборки и разборки пакетов
CCANPort                g_ExtCAN;                  // Данные внешнего CAN порта
can_frame_t             g_aCANInBuffer[256];       // Массив для приема и сборки CAN пакетов
can_frame_t             g_aCANOutBuffer[33*8];     // Массив для отправки CAN пакетов
u16                     g_u16CANID = 0;            // Идентификатор CAN

// Индексы кнопок
enum eInputs
{
   INPUT_1_INDEX = 0,                              // Дискретный вход 1 управляется замыканием на "землю"
   INPUT_2_INDEX,                                  // Дискретный вход 2 управляется замыканием на "землю"
   INPUT_3_INDEX,                                  // Дискретный вход 3 управляется замыканием на "землю"
   INPUT_4_INDEX,                                  // Дискретный вход 4 управляется замыканием на "землю"
   ONBOARD_BUTTON_INDEX,                           // Набортная кнопка
};

// Режим работы кнопки
enum eButtonMode 
{
   BUTTON_MODE_OFF = 0,                            // Канал выключен
   BUTTON_MODE_DIRECT,                             // Прямое управление (Нажатие - 1, Отжатие - 0)
   BUTTON_MODE_TRIGGER,                            // Триггерное переключение (изменение фронта изменение значения)
};

// Структура для хранения состояния бинарного входа
typedef struct input_data_s
{
   u8             m_u8Mode;                        // Режим работы дискретного входа
   u16            m_u16Delay;                      // Время долгого удержания
   struct
   {
      unsigned m_bMode        :  1;                // Режим работы триггера
      unsigned m_bOldValue    :  1;                // Предедущее значение канала
      unsigned m_bPressValue  :  1;                // Текущее тригерное значение короткого нажатия
      unsigned m_bHoldValue   :  1;                // Текущее тригерное значение длинного удержания
      unsigned m_bSendLong    :  1;                // Было отправлена датаграмма долгого удержания
   } m_Flags;
} input_data_t;

#if MAX_INPUTS != 0

