iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Firmware/iRidiumDevice/CDevice.cpp
   // Подготовка структуры к заполнению
   memset(&out_rInfo, 0, in_stSize);
   
   // Проверка индекса канала
   if(in_stIndex < MAX_DEVICE_TAGS)
   {
      // Копирование описания канала обратной связи в обучную память
      const device_tag_t* l_pTag = &g_aDeviceTags[in_stIndex];
      // Копирование данных
      out_rInfo.m_u32ID    = l_pTag->m_u32ID;
      out_rInfo.m_pszName  = l_pTag->m_pszName;
      out_rInfo.m_u8Type   = l_pTag->m_u8Type;
      
      // Получение значения канала обратной связи
      if(GetTagValue(out_rInfo.m_u32ID, out_rInfo.m_u8Type, out_rInfo.m_Value))
      {
         // Получение размера данных канала
         l_u8Result = GetValueSize(out_rInfo.m_u8Type, out_rInfo.m_Value);
         // Добавление размера имени (4 байта на идентификатор плюс размер имени и 1 байт на 0 в конце строки)
         l_u8Result += (4 + strlen(out_rInfo.m_pszName) + 1);
      }
   }
   return l_u8Result;
}

/**
   Получение описания канала обратной связи, по идентификатору
   на входе    :  in_u32TagID       - идентификатор канала обратной связи
                  out_rDescription  - ссылка на структуру куда нужно поместить описание канала обратной связи
   на выходе   :  успешность получения данных тега
*/
bool CDevice::GetTagDescription(u32 in_u32TagID, iridium_tag_description_t& out_rDescription)
{
   bool l_bResult = false;
   
   // Поиск канала управления в таблице
   size_t l_stIndex = GetTagIndex(in_u32TagID);
   if(l_stIndex != (size_t)-1)
   {
      // Получение индекса и маски в массиве хранения владения
      u8 l_u8Index = l_stIndex >> 3;
      u8 l_u8Mask = 1 << (l_stIndex & 0x7);
      
      // Копирование данных в обычную память
      const device_tag_t* l_pTag = &g_aDeviceTags[l_stIndex];
      // Копируем данные описания канала управления
      out_rDescription.m_ID.m_u8Type = l_pTag->m_u8Type;
      out_rDescription.m_ID.m_Min.m_u64Value = l_pTag->m_u64Min;
      out_rDescription.m_ID.m_Max.m_u64Value = l_pTag->m_u64Max;
      out_rDescription.m_ID.m_Step.m_u64Value = l_pTag->m_u64Step;
      out_rDescription.m_ID.m_pszDescription = l_pTag->m_pszDesc;
      
      // Получение флага владения
      out_rDescription.m_Flags.m_bOwner = (0 != (g_aTagOwners[l_u8Index] & l_u8Mask));
      // Получение переменной
      out_rDescription.m_u16Variable = g_aTagsVariable[l_stIndex];
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Установка каналу обратной связи глобальной переменной
   на входе    :  in_u32TagID      - идентификатор тега
                  in_bOwner        - признак владения
                  in_u16Variable   - идентификатор переменной
   на выходе   :  *
*/
bool CDevice::LinkTagAndVariable(u32 in_u32TagID, bool in_bOwner, u16 in_u16Variable)
{
   bool l_bResult = false;
   size_t l_stIndex = GetTagIndex(in_u32TagID);
   if(l_stIndex != (size_t)-1)
   {
      u8 l_u8Index = l_stIndex >> 8;
      u8 l_u8Mask = 1 << (l_stIndex & 0x7);
      // Запись глобальной переменной в энергонезависимую память
      EEPROM_WriteU16(EEPROM_U16_TAG_VARIABLES + l_stIndex * 2, in_u16Variable);
      // Запись глобальной переменной в обычную память
      g_aTagsVariable[l_stIndex] = in_u16Variable;
      // Выставим флаг владения
      if(in_bOwner)
         g_aTagOwners[l_u8Index] |= l_u8Mask;
      else
         g_aTagOwners[l_u8Index] &= ~l_u8Mask;
      // Запись маски владения в энергонезависимую память
      EEPROM_WriteU8(EEPROM_U8_OWNER_VARIABLE + l_u8Index, g_aTagOwners[l_u8Index]);
      EEPROM_NeedSaveBuffer();
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Установка значения канала обратной связи
   на входе    :  in_u32TagID - идентификатор канала обратной связи
                  in_u8Type   - тип значения канала управления
                  in_rValue   - ссылка на значение канала управления
                  in_u8Flags  - список флагов
   на выходе   :  успешность установки значения канала управления
*/
bool CDevice::SetTagValue(u32 in_u32TagID, u8 in_u8Type, universal_value_t& in_rValue, u8 in_u8Flags)
{
   bool l_bResult = false;
   // Поиск канала управления в таблице
   size_t l_stIndex = GetTagIndex(in_u32TagID);
   if(l_stIndex != (size_t)-1)
   {
      // Отправка значения в канал
      ChangeVariable(g_aTagsVariable[l_stIndex], in_u8Type, in_rValue);
   }      
   return l_bResult;
}

/**
   Получение количества каналов управления на устройстве
   на входе    :  *
   на выходе   :  количество каналов управления
*/
size_t CDevice::GetChannels()
{
   return MAX_DEVICE_CHANNELS;
}

/**
   Получение индекса по идентификатору канала управления
   на входе    :  in_u32ChannelID   - идентификатор канала управления
   на выходе   :  == -1 - идентификатор не найден
                  != -1 - индекс канала управления
*/
size_t CDevice::GetChannelIndex(u32 in_u32ChannelID)
{
   size_t l_stResult = (size_t)-1;
   
   // Обход таблицы каналов управления
   for(size_t i = 0; i < MAX_DEVICE_CHANNELS; i++)
   {
      // Поиск идентификтора в таблице
      if(g_aDeviceChannels[i].m_u32ID != in_u32ChannelID)
         continue;
      // Канал управления найден
      l_stResult = i;
      break;
   }

   return l_stResult;
}

/**
   Получение данных канала, по индексу
   на входе    :  in_stIndex  - индекс канала
                  out_rInfo   - ссылка на структуру куда нужно поместить данные
   на выходе   :  размер данных
*/
size_t CDevice::GetChannelData(size_t in_stIndex, iridium_channel_info_t& out_rInfo)
{
   size_t l_stResult = 0;
   // Подготовка структуры к заполнению
   memset(&out_rInfo, 0, sizeof(iridium_channel_info_t));
   // Копирование описания канала
   if(in_stIndex < MAX_DEVICE_CHANNELS)
   {
      // Перенос из флеша в обычную память
      const device_channel_t* l_Channel = &g_aDeviceChannels[in_stIndex];
      
      // Копирование параметров
      out_rInfo.m_u32ID    = l_Channel->m_u32ID;
      out_rInfo.m_pszName  = l_Channel->m_pszName;
      out_rInfo.m_u8Type   = l_Channel->m_u8Type;

      // Получение значения канала      
      if(GetChannelValue(out_rInfo.m_u32ID, out_rInfo.m_u8Type, out_rInfo.m_Value))
      {
         // Вычисление размера структуры (4 байта на идентификатор плюс длинна имени плюс 1 байт на конец строки)
         l_stResult = 4 + strlen(out_rInfo.m_pszName) + 1;
      }
   }

   return l_stResult;
}

/**
   Получение описания канала управления, по идентификатору
   на входе    :  in_u32ChannelID   - идентификатор канала управления
                  out_rDescription  - ссылка на структуру куда нужно поместить описание канала управления
   на выходе   :  успешность
*/
bool CDevice::GetChannelDescription(u32 in_u32ChannelID, iridium_channel_description_t& out_rDescription)
{   
   bool l_bResult = false;
   device_channel_t l_Channel;
   // Поиск канала обратной связи в таблице
   size_t l_stChannel = GetChannelIndex(in_u32ChannelID);
   if(l_stChannel != (size_t)-1)
   {
      // Копируем данные описания канала
      memcpy(&l_Channel, &g_aDeviceChannels[l_stChannel], sizeof(device_channel_t));
      
