iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Firmware/iRidiumDevice/CDevice.cpp
      // Заполнение параметров
      out_rDescription.m_ID.m_u8Type            = l_Channel.m_u8Type;
      out_rDescription.m_ID.m_Min.m_u64Value    = l_Channel.m_u64Min;
      out_rDescription.m_ID.m_Max.m_u64Value    = l_Channel.m_u64Max;
      out_rDescription.m_ID.m_Step.m_u64Value   = l_Channel.m_u64Step;
      out_rDescription.m_ID.m_pszDescription    = l_Channel.m_pszDesc;
      out_rDescription.m_Flags.m_bWritePassword = (0 != (l_Channel.m_u8Flags & CF_W));
      out_rDescription.m_Flags.m_bReadPassword  = (0 != (l_Channel.m_u8Flags & CF_R));
      out_rDescription.m_u8MaxVariables         = l_Channel.m_u8MaxVariables;
      
      out_rDescription.m_u8Variables = MAX_VARIABLES;
      out_rDescription.m_pVariables = NULL;

#if MAX_SAVE_CHANNELS != 0
      if(l_stChannel >= START_SAVE_CHANNEL_INDEX && l_stChannel <= END_SAVE_CHANNEL_INDEX)
      {
         l_stChannel -= START_SAVE_CHANNEL_INDEX;
         out_rDescription.m_pVariables = g_aChannelsVariable[l_stChannel];
      }
#endif
      l_bResult = true;
   }
   return l_bResult;
}

/**
   Установка каналу глобальной переменной
   на входе    :  in_u32ChannelID  - идентификатор канала
                  in_u8Variables   - колличество переменных
                  in_pVariables    - указатель на список идентификаторов глобальных переменных
   на выходе   :  *
*/
bool CDevice::LinkChannelAndVariable(u32 in_u32ChannelID, u8 in_u8Variables, u16* in_pVariables)
{
   bool l_bResult = false;

#if MAX_SAVE_CHANNELS != 0

   // Проверка входных параметров
   size_t l_stIndex = GetChannelIndex(in_u32ChannelID);
   if(l_stIndex != (size_t)-1)
   {
      if(l_stIndex >= START_SAVE_CHANNEL_INDEX && l_stIndex <= END_SAVE_CHANNEL_INDEX)
      {
         l_stIndex -= START_SAVE_CHANNEL_INDEX;
         // Проверка количества переменных
         if(in_u8Variables > MAX_VARIABLES)
            in_u8Variables = MAX_VARIABLES;

         // Запись списка глобальных переменных
         for(u8 i = 0; i < MAX_VARIABLES; i++)
         {
            // Запись в текущую память
            g_aChannelsVariable[l_stIndex][i] = (i < in_u8Variables ? in_pVariables[i] : 0);
            // Запись переменной в энергонезависимую память
            EEPROM_WriteU16(EEPROM_U16_CHANNEL_VARIABLES + (l_stIndex * MAX_VARIABLES + i) * 2, g_aChannelsVariable[l_stIndex][i]);
         }
         EEPROM_NeedSaveBuffer();
         l_bResult = true;
      }
   }

#endif

   return l_bResult;
}

/**
   Установка значения канала управления
   на входе    :  in_u32ChannelID   - идентификатор канала управления
                  in_u8Type         - тип значения канала управления
                  in_rValue         - ссылка на значение канала управления
                  in_u8Flags        - список флагов
   на выходе   :  успешность установки значения канала управления
*/
bool CDevice::SetChannelValue(u32 in_u32ChannelID, u8 in_u8Type, universal_value_t& in_rValue, u8 in_u8Flags)
{
   bool l_bResult = false;
   
   switch(in_u32ChannelID)
   {
   // Изменение имени устройства
   case CHANNEL_NAME:
      if(in_u8Type == IVT_STRING8 && in_rValue.m_Array.m_stSize)
      {
         // Сохраним новое имя устройства
         size_t l_stSize = (in_rValue.m_Array.m_stSize > MAX_DEVICE_NAME_SIZE) ? MAX_DEVICE_NAME_SIZE : in_rValue.m_Array.m_stSize;
         memcpy(g_szDeviceName, in_rValue.m_Array.m_pPtr, l_stSize);
         // Корректировка имени
         SetValidEndByUTF8(g_szDeviceName, l_stSize, MAX_DEVICE_NAME_SIZE);
         // Запись в энергонезависимую память
         for(u8 i = 0; i < MAX_DEVICE_NAME_SIZE; i++)
            EEPROM_WriteU8(EEPROM_DEVICE_NAME + i, g_szDeviceName[i]);
         l_bResult = true;
      }
      break;
      
   // Изменение PIN кода
   case CHANNEL_PIN: 
      if(in_u8Type == IVT_U32)
      {
         // Сохраним новое значение PIN
         EEPROM_WriteU32(EEPROM_U32_PIN, in_rValue.m_u32Value);
         l_bResult = true;
      }
      break;

   // Изменение Test
   case CHANNEL_TEST: 
      if(in_u8Type == IVT_U8)
      {
         // Сохраним новое значение PIN
         g_u8Test = in_rValue.m_u8Value;
         // Генерация изменения значения 
         size_t l_stIndex = GetTagIndex(TAG_TEST);
         if(l_stIndex != (size_t)-1)
            SendSetVariableRequest(g_aTagsVariable[l_stIndex], in_u8Type, in_rValue);
         l_bResult = true;
      }
      break;
  }
  return l_bResult;
}

/**
   Обработчик получения запроса на открытие потока
   на входе    :  in_pszName  - имя потока
                  in_eMode    - режим открытия потока
   на выходе   :  идентификатор открытого потока, если поток не был открыт возвражаемый результат равен 0
*/
u8 CDevice::StreamOpen(const char* in_pszName, eIridiumStreamMode in_eMode)
{
   u8 l_u8Result = 0;

   // Проверка имени запрашиваемого потока
   if(in_pszName && !strcmp(in_pszName, FIRMWARE_NAME))
   {
      if(in_eMode == IRIDIUM_STREAM_MODE_WRITE)
      {
         // Запишем в энергонезависимую память состояние загрузки прошивки
         EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_DOWNLOAD);
         // Запись адреса
         EEPROM_WriteU16(EEPROM_U16_FIRMWARE_ADDRESS, GetSrcAddress());
         // Запись идентификатора транзакции
         EEPROM_WriteU16(EEPROM_U16_FIRMWARE_TID, m_InMH.m_u16TID);
         EEPROM_ForceSaveBuffer();
         
         // Осуществим переход в загрузчик через сброс контроллера
         Reboot();
      }
   }

   return l_u8Result;
}

/**
   Обработчик получения ответа на запрос открытия потока
   на входе    :  in_pszName     - имя потока
                  in_eMode       - режим открытия потока
                  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamOpenResult(const char* in_pszName, eIridiumStreamMode in_eMode, u8 in_u8StreamID)
{
}

/**
   Обработчик получения запроса передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - размер данных блока
                  in_pBuffer     - указатель на буфер с данными блока
   на выходе   :  количество обработанных данных
*/
size_t CDevice::StreamBlock(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize, const void* in_pBuffer)
{
   return in_stSize;
}

/**
   Обработчик получения ответа на запрос передачи данных блока
   на входе    :  in_u8StreamID  - идентификатор потока
                  in_u8BlockID   - идентификатор блока
                  in_stSize      - количество обработанных данных
   на выходе   :  *
*/
void CDevice::StreamBlockResult(u8 in_u8StreamID, u8 in_u8BlockID, size_t in_stSize)
{
}

/**
   Обработчик закрытия потока
   на входе    :  in_u8StreamID  - идентификатор потока
   на выходе   :  *
*/
void CDevice::StreamClose(u8 in_u8StreamID)
{
}

/**
   Получение Smart API информации
   на входе    :  out_rBuffer - ссылка на указатель куда нужно указатель на данные Smart API
                  out_rSize   - ссылка на переменную куда нужно поместить размер данных Smart API
   на выход    :  успешность получения данных
*/
bool CDevice::GetSmartAPI(void*& out_rBuffer, size_t& out_rSize)
{
   out_rBuffer = NULL;//&g_SmartAPI;
   out_rSize   = 0;//sizeof(g_SmartAPI);
   return true;
}

/**
   Инициализация устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Setup()
{
   iridium_search_info_t l_Search;
   // Чтение текущего состояния
   if(EEPROM_ReadU8(EEPROM_U8_FIRMWARE_ID) != FIRMWARE_ID_R0_4_BUTTON)
   {
      // Сброс PIN кода
      EEPROM_WriteU32(EEPROM_U32_PIN, 0);

      // Загрузка флага владения
      for(u8 i = 0; i < ((MAX_DEVICE_CHANNELS + 7) / 8); i++)
         EEPROM_WriteU8(EEPROM_U8_OWNER_VARIABLE + i, 0);
   
      // Загрузка ранее сохраненных параметров каналов
      for(u8 i = 0; i < MAX_SAVE_TAGS; i++)
         EEPROM_WriteU16(EEPROM_U16_TAG_VARIABLES + i * 2, 0);
   
