iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Firmware/iRidiumDevice/CDevice.cpp
#if MAX_SAVE_CHANNELS != 0
      // Загрузка ранее сохраненных параметров тегов
      for(u8 c = 0; c < MAX_SAVE_CHANNELS; c++)
         for(u8 v = 0; v < MAX_VARIABLES; v++)
            EEPROM_WriteU16(EEPROM_U16_CHANNEL_VARIABLES + (c * MAX_VARIABLES + v) * 2, 0);
#endif

#if MAX_INPUTS != 0

      // Загрузка параметров работы кнопки
      for(u8 i = 0; i < MAX_INPUTS; i++)
      {
         EEPROM_WriteU8(EEPROM_U8_INPUT_FLAGS + i, 0);
         EEPROM_WriteU16(EEPROM_U16_INPUT_TIME + i * 2, 0);
      }

#endif

      // Сброс параметров
      EEPROM_WriteU8(EEPROM_U8_FIRMWARE_ID, FIRMWARE_ID_R0_4_BUTTON);
      // Запись значений в энергонезависимую память
      EEPROM_WriteU8(EEPROM_U8_MODE, BOOTLOADER_MODE_RUN);
      EEPROM_ForceSaveBuffer();
   }

   // Загрузка локального идентификатора
   m_Address = EEPROM_ReadU8(EEPROM_U8_LID);
   
   // Загрузка флага владения
   for(u8 i = 0; i < ((MAX_SAVE_TAGS + 7) / 8); i++)
      g_aTagOwners[i] = EEPROM_ReadU8(EEPROM_U8_OWNER_VARIABLE + i);
   
   // Загрузка ранее сохраненных параметров каналов
   for(u8 i = 0; i < MAX_SAVE_TAGS; i++)
      g_aTagsVariable[i] = EEPROM_ReadU16(EEPROM_U16_TAG_VARIABLES + i * 2);

#if MAX_SAVE_CHANNELS != 0
   // Загрузка ранее сохраненных параметров тегов
   for(u8 c = 0; c < MAX_SAVE_CHANNELS; c++)
      for(u8 v = 0; v < MAX_VARIABLES; v++)
         g_aChannelsVariable[c][v] = EEPROM_ReadU16(EEPROM_U16_CHANNEL_VARIABLES + (c * MAX_VARIABLES + v) * 2);
#endif

#if MAX_INPUTS != 0

   // Загрузка параметров работы кнопки
   for(u8 i = 0; i < MAX_INPUTS; i++)
   {
      u8 l_u8Temp = EEPROM_ReadU8(EEPROM_U8_INPUT_FLAGS + i);
      g_aInputData[i].m_u8Mode         = l_u8Temp & 0xF;
      g_aInputData[i].m_Flags.m_bMode  = (0 != (l_u8Temp & 0x80));
      g_aInputData[i].m_u16Delay       = EEPROM_ReadU16(EEPROM_U16_INPUT_TIME + i * 2);
   }

#endif

   // Чтение имени устройства
   for(u8 i = 0; i < MAX_DEVICE_NAME_SIZE; i++)
      g_szDeviceName[i] = EEPROM_ReadU8(EEPROM_DEVICE_NAME + i);
   // Корректировка имени
   SetValidEndByUTF8(g_szDeviceName, MAX_DEVICE_NAME_SIZE, MAX_DEVICE_NAME_SIZE);
      
   // Генерация идентификатора
   GenerateHWID();
   
   // Инициализация шины
   BUS_Init();
   
   // Установка фильтров
   g_u16CANID = GetCRC16Modbus(1, (u8*)g_pszHWID, sizeof(g_pszHWID));
   BUS_SetFilter(g_u16CANID, m_Address);

   // Выключение набортного светодиода
   HAL_GPIO_WritePin(Onboard_LED_GPIO_Port, Onboard_LED_Pin, GPIO_PIN_SET);

   // Отправка информации об устройстве
   if(GetSearchInfo(l_Search))
      SendSearchResponse(GetTID(), l_Search);
}

/**
   Основной цикл работы устройства
   на входе    :  *
   на выходе   :  *
*/
void CDevice::Loop()
{
   // обработка нажатий
   WorkInputs();
   
   // Обработка сохранения изменений
   EEPROM_WorkBuffer();
   
   // Запись во внешний CAN порт
   WriteToExtCan();

   // Чтение и обработка данных с внешнего CAN порта
   ReadFromExtCan();
}

/**
   Цикл обработки нажатий
   на входе    :  *
   на выходе   :  *
*/
void CDevice::WorkInputs()
{

#if MAX_INPUTS != 0

   universal_value_t l_Val;
   iridium_search_info_t l_Search;
   // Обработка нажатий
   IO_UpdateInput(g_aInputs, sizeof(g_aInputs) / sizeof(g_aInputs[0]));

   // Если была нажата набортная кнопка, пошлем в шину информацию о себе
   if(g_aInputs[ONBOARD_BUTTON_INDEX].m_Flags.m_bChange && g_aInputs[ONBOARD_BUTTON_INDEX].m_Flags.m_bCurValue)
   {
      // Получение информации об устройстве
      if(GetSearchInfo(l_Search))
      {
         // Отправка информации в шину
         SendSearchResponse(GetTID(), l_Search);
      }
   }

   // Обработка дискретных входов
   for(u8 i = 0; i < MAX_INPUTS; i++)
   {
      // Получение значения у учетом инвертирования значения
      bool l_bValue = g_aInputs[i].m_Flags.m_bCurValue;
      bool l_bOld = g_aInputData[i].m_Flags.m_bOldValue;
      u8 l_u8Press = TAG_PRESS_1 + i * 2 - 1;
      u8 l_u8Long = l_u8Press + 1;

      // Прямое управление
      if(g_aInputData[i].m_u8Mode == BUTTON_MODE_DIRECT)
      {
         // Подготовка значения
         l_Val.m_bValue = l_bValue;

         // Проверка изменения значения
         if(l_bValue != l_bOld)
         {
            // Если было длительное удержание, сбросим длинное удержание
            if(g_aInputData[i].m_Flags.m_bSendLong && !l_bValue)
               ChangeVariable(g_aTagsVariable[l_u8Long], IVT_BOOL, l_Val);

            // Отправка значения в шину при коротком нажатии
            ChangeVariable(g_aTagsVariable[l_u8Press], IVT_BOOL, l_Val);
            // Сбросим флаг отправки значения долгого удержания
            g_aInputData[i].m_Flags.m_bSendLong = false;
            // Запомним значение
            g_aInputData[i].m_Flags.m_bOldValue = l_bValue;
         } else
         {
            // Проверка на долгое удержание
            if(!g_aInputData[i].m_Flags.m_bSendLong && l_bValue && g_aInputs[i].m_u32ChangeTime && (HAL_GetTick() - g_aInputs[i].m_u32ChangeTime) > g_aInputData[i].m_u16Delay)
            {
               // Отправка значения в шину при долгом удержании
               ChangeVariable(g_aTagsVariable[l_u8Long], IVT_BOOL, l_Val);
               // Установим флаг отправки значения долгого удержания
               g_aInputData[i].m_Flags.m_bSendLong = true;
            }
         }
      // Тригерное управление
      } else if(g_aInputData[i].m_u8Mode == BUTTON_MODE_TRIGGER)
      {
         // Проверка изменения значения
         if(l_bValue != l_bOld)
         {
            // Запомним текущее значение
            g_aInputData[i].m_Flags.m_bOldValue = l_bValue;
            // Коррекция входа, по нажатию или по отжатию
            l_bValue ^= g_aInputData[i].m_Flags.m_bMode;
            if(l_bValue)
            {
               g_aInputData[i].m_Flags.m_bPressValue ^= 1;
               // Отправка значения в шину при коротком нажатии
               l_Val.m_bValue = g_aInputData[i].m_Flags.m_bPressValue;
               ChangeVariable(g_aTagsVariable[l_u8Press], IVT_BOOL, l_Val);
               // Сбросим флаг отправки значения долгого удержания
               g_aInputData[i].m_Flags.m_bSendLong = false;
            }
         } else
         {
            // Проверка на долгое удержание
            if(!g_aInputData[i].m_Flags.m_bSendLong && l_bValue && g_aInputs[i].m_u32ChangeTime && (HAL_GetTick() - g_aInputs[i].m_u32ChangeTime) > g_aInputData[i].m_u16Delay)
            {
               g_aInputData[i].m_Flags.m_bHoldValue ^= 1;
               // Отправка значения в шину при долгом удержании
               l_Val.m_bValue = g_aInputData[i].m_Flags.m_bHoldValue;
               ChangeVariable(g_aTagsVariable[l_u8Long], IVT_BOOL, l_Val);
               // Установим флаг отправки значения долгого удержания
               g_aInputData[i].m_Flags.m_bSendLong = true;
            }
         }
      }
   }

#endif

