iRidium-Mobile/BUS77-SDK/Example/STM32/STM32F103C8T6/Template/Firmware/iRidiumDevice/CDevice.cpp
}

/**
   Изменение значения глобальной переменной
   на входе    :  in_u16Variable - идентификатор изменяемой переменной
                  in_u8Type      - тип переменной
                  in_rValue      - ссылка на данные значения
   на выходе   :  *
*/
void CDevice::ChangeVariable(u16 in_u16Variable, u8 in_u8Type, universal_value_t& in_rValue)
{
   // Отправка значения на шину
   SendSetVariableRequest(in_u16Variable, in_u8Type, in_rValue);
   // Изменение значения
   SetVariable(in_u16Variable, in_u8Type, in_rValue, IRIDIUM_FLAGS_END);
}

/**
   Обработка внешнего порта
   на входе    :  *
   на выходе   :  *
*/
void CDevice::ReadFromExtCan()
{
   // Поиск пакета в буфере
   void* l_pBuffer = NULL;
   size_t l_stSize = 0;
   bool l_bResult = false;
   
   // Получение указателя на данные порта
   CCANPort* l_pPort = GetCANPort(&hcan);
   if(l_pPort)
   {
      // Чтение входящих сообщений
      HAL_CAN_Receive_IT(&hcan, CAN_FIFO0); 

      // Получение пакета
      l_bResult = l_pPort->GetPacket(l_pBuffer, l_stSize);
      
      // Блокирование доступа к порту
      LockCANPort(&hcan);
      // Удаление обработанных пакетов
      l_pPort->Flush();
      // Разблокирование доступа к порту
      UnLockCANPort(&hcan);
      
      // Проверка наличия данных
      if(l_bResult)
      {
         // Установка данных буфера
         m_InBuffer.SetBuffer(l_pBuffer, l_stSize);
         
         // Отфильтруем лишнее
         m_InBuffer.FilterNoiseAndForeignPacket(m_Address);
   
         // Обрабатывать входящий поток пока исходящий буфер не заполнен на половину
         if(m_InBuffer.OpenPacket())
         {
            iridium_packet_header_t* l_pPH = m_InBuffer.GetPacketHeader();
      
            void* l_pPacketPtr = m_InBuffer.GetMessagePtr();
            size_t l_stPacketSize = m_InBuffer.GetMessageSize();
      
#if defined(IRIDIUM_ENABLE_CIPHER)
            // Декодирование сообщения
            if(DecodeMessage((eIridiumCipher)l_pPH->m_Flags.m_u3Crypt, m_InBuffer.GetMessagePtr(), m_InBuffer.GetMessageSize(), l_pPacketPtr, l_stPacketSize))
#endif
            {
               // Обработка сообщения
               ProcessMessage(l_pPH, l_pPacketPtr, l_stPacketSize);
            }
            // Закрытие шинного сообщения
            m_InBuffer.ClosePacket();
         }
         
         // Обработка полученого пакета
         l_pPort->DeletePacket();
      }
   }
}

/**
   Обработка внешнего порта
   на входе    :  *
   на выходе   :  *
*/
void CDevice::WriteToExtCan()
{
   // Получение указателя на данные порта
   CCANPort* l_pPort = GetCANPort(&hcan);
   if(l_pPort)
   {
      // Получим фрейм для отправки в CAN
      can_frame_t* l_pPtr = l_pPort->GetFrame();
      if(l_pPtr)
      {
         // Установим расширенный размер кадра
         hcan.pTxMsg->IDE = CAN_ID_EXT;
      
         // Назначаем идентификатор сообщения
         hcan.pTxMsg->ExtId = l_pPtr->m_u32ExtID;
      
         // Указываем длинну сообщения
         hcan.pTxMsg->DLC = l_pPtr->m_u8Size;
      
         // Копируем данные для отправки
         memcpy(hcan.pTxMsg->Data, l_pPtr->m_aData, l_pPtr->m_u8Size);
      
         // Отправляем данные
         if(HAL_CAN_Transmit_IT(&hcan) == HAL_OK)
            l_pPort->DeleteFrame();
      }
   }
}

/**
   Получение значения канала управления
   на входе    :  in_u32ChannelID   - идентиифкатор канала управления
                  out_rType         - ссылка на переменную куда нужно тип значения канала управления
                  out_rValue        - ссылка на переменную куда нужно поместить значение канала управления
   на выходе   :  успешность получения значения
*/
bool CDevice::GetChannelValue(u32 in_u32ChannelID, u8& out_rType, universal_value_t& out_rValue)
{
   bool l_bResult = true;

   switch(in_u32ChannelID)
   {
      // Системный канал с именем устройства
      case CHANNEL_NAME:
         out_rType = IVT_STRING8;
         out_rValue.m_Array.m_pPtr = &g_szDeviceName;
         out_rValue.m_Array.m_stSize = strlen((char*)out_rValue.m_Array.m_pPtr);
         break;

      // Системный канал с PIN кодом
      case CHANNEL_PIN:
         out_rType = IVT_U32;
         out_rValue.m_u32Value = EEPROM_ReadU32(EEPROM_U32_PIN);
         break;

      // Системный канал для перезагрузки контроллера
      case CHANNEL_REBOOT:
         out_rType = IVT_BOOL;
         out_rValue.m_bValue = false;
         break;

      // Системный канал для перезагрузки контроллера
      case CHANNEL_TEST:
         out_rType = IVT_U8;
         out_rValue.m_u8Value = g_u8Test;
         break;

      // Значение не найдено
      default:
         l_bResult = false;
         break;
   }

   return l_bResult;
}

/**
   Получение значения канала обратной связи
   на входе    :  in_u32TagID - идентификатор канала обратной связи
                  out_rType   - ссылка на переменную куда нужно тип значения канала обратной связи
                  out_rValue  - ссылка на переменную куда нужно поместить значение канала обратной связи
   на выходе   :  успешность получения значения
*/
bool CDevice::GetTagValue(u32 in_u32TagID, u8& out_rType, universal_value_t& out_rValue)
{
   bool l_bResult = true;

   switch(in_u32TagID)
   {
   case TAG_ERROR:
      out_rType = IVT_U8;
      out_rValue.m_u8Value = 0;
      break;

   case TAG_TEST:
      out_rType = IVT_U8;
      out_rValue.m_u8Value = g_u8Test;
      break;

   default:
      l_bResult = false;
      break;
   }

   return l_bResult;
}

/**
   Вызов инициализации устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Init()
{
   // Установка границ энергонезависимой памяти
   EEPROM_Init(EEPROM_START, EEPROM_END);
   
   // Включение буферизации EEPROM
   EEPROM_SetBuffer(g_aEEPROM, EEPROM_MAX);
}

/**
   Вызов настройки устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Setup()
{
   g_Device.Setup();
}

/**
   Вызов основного цикла устройства
   на входе    :  *
   на выходе   :  *
*/
void iRidiumDevice_Loop()
{
   g_Device.Loop();
}
